app/controllers/locations_controller.rb

SELECT * FROM `locations` ORDER BY name
---
  def index
    @locations = Location.all(:order => "name").paginate(:per_page => @@per_page, :page => params[:page])

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def show
    @location = Location.find(params[:id])

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO `locations` (`name`, `created_at`, `updated_at`) VALUES('Chennai', '2011-05-31 13:39:46', '2011-05-31 13:39:46')
---
  def create
    @location = Location.new(params[:location])

    respond_to do |format|
      if @location.save

SELECT * FROM `locations` WHERE (`locations`.`id` = 1)
---
  def update
    @location = Location.find(params[:id])

SELECT * FROM `locations` WHERE (`locations`.`id` = 3)
DELETE FROM `locations` WHERE `id` = 3
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy