app/controllers/qualifications_controller.rb

  def index
    @qualifications = Qualification.all(:order => "name").paginate(:per_page =>@@per_page, :page => params[:page])
---
SELECT * FROM `qualifications` ORDER BY name

  def create
    @qualification = Qualification.new(params[:qualification])

    respond_to do |format|
      if @qualification.save
---
INSERT INTO `qualifications` (`name`, `created_at`, `updated_at`) VALUES('B.E', '2011-05-31 13:47:02', '2011-05-31 13:47:02')