app/controllers/skills_controller.rb

  def index
    @skills = Skill.all.paginate(:per_page => @@per_page, :page => params[:page])
---
SELECT * FROM `skills`

  def show
    @skill = Skill.find(params[:id])
---
SELECT * FROM `skills` WHERE (`skills`.`id` = 1)

  def edit
    @skill = Skill.find(params[:id])
---
SELECT * FROM `skills` WHERE (`skills`.`id` = 2)

  def create
    @skill = Skill.new(params[:skill])

    respond_to do |format|
      if @skill.save
---
INSERT INTO `skills` (`name`, `created_at`, `updated_at`) VALUES('Java', '2011-06-01 07:07:39', '2011-06-01 07:07:39')

  def update
    @skill = Skill.find(params[:id])

    respond_to do |format|
      if @skill.update_attributes(params[:skill])
---
SELECT * FROM `skills` WHERE (`skills`.`id` = 2)
UPDATE `skills` SET `updated_at` = '2011-06-01 07:08:13', `name` = 'Ruby on Rails ' WHERE `id` = 2

  def destroy
    @skill = Skill.find(params[:id])
    @skill.destroy
---
SELECT * FROM `skills` WHERE (`skills`.`id` = 1)
DELETE FROM `skills` WHERE `id` = 1