app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY name
---
  def index
    @users = User.all(:order => "name").paginate(:per_page => @@per_page, :page => params[:page])

INSERT INTO `attachments` (`size`, `created_at`, `content_type`, `thumbnail`, `updated_at`, `parent_id`, `filename`, `height`, `attachable_type`, `attachable_id`, `width`, `active`) VALUES(67061, '2011-06-01 06:11:07', 'image/jpeg', NULL, '2011-06-01 06:11:07', NULL, '20370_239884464139_53325039139_2961718_2495813_n.jpg', 604, NULL, NULL, 487, 1)
INSERT INTO `users` (`name`, `passport_number`, `year_of_passout`, `created_at`, `employee_type`, `qualification_id`, `current_location_id`, `pan_number`, `designation`, `current_organization`, `current_ctc`, `updated_at`, `expected_ctc`, `relevant_experience`, `phone_number`, `total_experience`, `organization`, `date_of_birth`, `preferred_location_id`, `email`, `notice_period`) VALUES(NULL, NULL, NULL, '2011-05-31 10:28:59', NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2011-05-31 10:28:59', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    if params[:commit] == "Create"
      @user = User.new(params[:user])
      if params[:attachable] && params[:attachable][:uploaded_data]
        @user.attachment = Attachment.create(params[:attachable])

SELECT * FROM `users` WHERE (`users`.`id` = 2)
INSERT INTO `attachments` (`size`, `created_at`, `content_type`, `thumbnail`, `updated_at`, `parent_id`, `filename`, `height`, `attachable_type`, `attachable_id`, `width`, `active`) VALUES(15455, '2011-06-01 06:13:52', 'image/jpeg', NULL, '2011-06-01 06:13:52', NULL, '1155-1374sorry-posters.jpg', 425, NULL, NULL, 342, 1)
UPDATE `attachments` SET `updated_at` = '2011-06-01 06:13:52', `attachable_type` = 0, `attachable_id` = 10 WHERE `id` = 2
UPDATE `users` SET `relevant_experience` = 'dfgdfg', `updated_at` = '2011-06-01 08:32:00', `current_ctc` = '0dfg', `year_of_passout` = '2011', `expected_ctc` = '0dfg', `qualification_id` = '--', `employee_type` = 'Permanent', `current_location_id` = 1, `notice_period` = '0fdgfdg', `total_experience` = '0dfg', `preferred_location_id` = 1 WHERE `id` = 6
---
  def update
    if  params[:commit] == "Update"
      @user = User.find(params[:id])
      if params[:attachable] && params[:attachable][:uploaded_data]
        @user.attachment = Attachment.create(params[:attachable])
      end
      respond_to do |format|
        if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 10)
---
  def download_file
    @user = User.find(params[:id])